"""საკლასო დავალება 1: ძირითადი სიის ოპერაციებიშექმენით სია სახელწოდებით ხილი,
რომელიც შეიცავს შემდეგ ელემენტებს:
"ვაშლი", "ბანანი", "ალუბალი", "თარიღი" და "ელდერბერი".
დაბეჭდეთ მთელი სია.
წვდომა და დაბეჭდვა სიის პირველ და ბოლო ელემენტებზე.
სიას დაამატეთ ახალი ხილი „ლეღვი“.
ამოიღეთ „ბანანი“ სიიდან.
შეცვალეთ მეორე ელემენტის მნიშვნელობა "მოცვი".
ამობეჭდეთ სიის სიგრძე."""


ხილი = ["ვაშლი", "ბანანი", "ალუბალი", "თარიღი", "ელდერბერი"]

print("სია:", ხილი)

print("პირველი ელემენტი:", ხილი[0])
print("ბოლო ელემენტი:", ხილი[-1])

ხილი.append("ლეღვი")

ხილი.remove("ბანანი")

ხილი[1] = "მოცვი"

print("სიის სიგრძე:", len(ხილი))
