"""საკლასო დავალება 2: ჩამოთვალეთ ფუნქციები და მეთოდები
შექმენით რიცხვების სია,
რომელიც შეიცავს შემდეგ მთელ რიცხვებს: 10, 20, 30, 40, 50, 60, 70, 80, 90.
გამოიყენეთ append() ფუნქცია სიის ბოლოს დასამატებლად რიცხვი 100.
გამოიყენეთ insert() ფუნქცია სიის დასაწყისში 5-ის დასამატებლად.
გამოიყენეთ remove() ფუნქცია სიიდან 30-ის ამოსაღებად.
გამოიყენეთ reverse() ფუნქცია სიის თანმიმდევრობის შესაცვლელად.
გამოიყენეთ index() ფუნქცია 50 რიცხვის ინდექსის მოსაძებნად.
გამოიყენეთ count() ფუნქცია დათვალეთ რამდენჯერ გამოჩნდება 20 სიაში."""




numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90]

numbers.append(100)

numbers.insert(0, 5)

numbers.remove(30)

numbers.reverse()

index_of_50 = numbers.index(50)

count_of_20 = numbers.count(20)

print("მიღებული სია:", numbers)
print("50-ის ინდექსი:", index_of_50)
print("20 რამდენჯერ არის სიაში:", count_of_20)