"""1) მომხმარებელს შემოატანინეთ ტესტში მიღებული ქულა,
თუ ქულა მეტია 90 - ზე და ნაკლებია 100 - ზე მაგ შემთხვევაში დაპრინტეთ,
თქვენ დაგიფინანსდებათ სწავლა სრულიად.
თუ მიღებული ქულა მეტია 70 - ზე და  ნაკლებია 80 - ზე მაგ შემთხვევაში დაპრინტეთ,
თქვენ დაგიფინანსდებათ სწავლა 1500 ლარით,
თუ მიღებული ქულა მეტია 40 -  ზე და ნაკლებია 70 - ზე მაგ შემთხვევაში დაპრინტეთ,
თქვენ დაგიფინანსდებათ სწავლა 500 ლარით, ხოლო თუ მიღებული ქულა ნაკლებია 40 ზე,
მაგ შემტხვევაში დაპრინტეთ, ტქვენ არ დაგიფინანსდებათ სწავლის პროცესი"""

score = int(input("what is your score? : "))

if score > 90 and score < 100:
    print ("your tution was fully funded")
elif score > 70 and score < 80:
    print ("your tution was funded with 1500 lari")

elif score > 40 and score < 70:
     print ("your tution was funded with 500 lari")
elif score < 40:
    print ("your tution wont be funded")
